; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; PUERTO Ejercicio 1 de Daniel P. y Alejandro G.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain puerto)
  (:requirements :strips :typing)
  (:types cinta muelle grua pila altura contenedor - object)
  (:predicates 
		; Indica si un contenedor es verde
		(verde ?c - contenedor)

		; Indica si un contenedor es blanco (no verde)
		(no-verde ?x - (either pila contenedor))

		; Indica si una cinta o grua estan libres, es decir, sin contenedor
		(libre ?x - (either cinta grua))

		; Indica que contenedor1 esta sobre contenedor2, o en caso de no tener contenedor
		; abajo tiene la pila
		(encima ?c - contenedor ?x - (either pila contenedor))

		; Indica si una grua, pila o contenedor se encuentra en una cinta, muelle, grua o pila
		(ubicado-en ?x1 - (either grua pila contenedor) ?x2 - (either cinta muelle grua pila))

		; Indica cuando un contenedor puede ser cogido por la grua. Se permite el tipo pila
		; porque cuando se deja un contenedor en una pila hay que poner como no disponible
		; el contenedor que queda abajo, pero en caso de estar la pila vacia se necesita que
		; este predicado acepte el tipo pila
		(disponible ?x - (either pila contenedor))

		; Indica el contenedor que es el top de la pila, en caso de estar vacia la pila, la
		; pila es el top de la propia pila
		(top ?x - (either pila contenedor) ?pila2 - pila)

		; La cinta conecta muelle origen con muelle destino
		(conecta-a ?ct - cinta ?m_o - muelle ?m_d - muelle)

		; Este predica se utiliza para controlar la altura maxima de las pilas
		(next ?a1 - altura ?a2 - altura)

		; Indica la altura actual de la pila
		(altura ?p - pila ?t - altura)

  )

  (:action coger-pila
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor - contenedor
			?altura_pila - altura
			?objeto_base - (either pila contenedor)
			?altura_anterior - altura
		)
		:precondition (
			and
			(libre ?grua)
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor ?pila)
			(ubicado-en ?objeto_base ?pila)
			(top ?contenedor ?pila)
			(encima ?contenedor ?objeto_base)
			(disponible ?contenedor)
			(altura ?pila ?altura_pila)
			(next ?altura_anterior ?altura_pila)
		)
		:effect(
			and
			(not (libre ?grua))
			(ubicado-en ?contenedor ?grua)
			(not (ubicado-en ?contenedor ?pila))
			(not (top ?contenedor ?pila))
			(not (encima ?contenedor ?objeto_base))
			(not (disponible ?contenedor))
			(disponible ?objeto_base)
			(top ?objeto_base ?pila)
			(not (altura ?pila ?altura_pila))
			(altura ?pila ?altura_anterior)
		)
  )

  (:action dejar-blanco-pila
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor - contenedor
			?altura_pila - altura
			?objeto_base - (either pila contenedor)
			?altura_posterior - altura
		)
		:precondition(
			and
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor ?grua)
			(ubicado-en ?objeto_base ?pila)
			(top ?objeto_base ?pila)
			(no-verde ?objeto_base)
			(altura ?pila ?altura_pila)
			(next ?altura_pila ?altura_posterior)
		)
		:effect(
			and
			(libre ?grua)
			(ubicado-en ?contenedor ?pila)
			(not (ubicado-en ?contenedor ?grua))
			(encima ?contenedor ?objeto_base)
			(top ?contenedor ?pila)
			(not (top ?objeto_base ?pila))
			(altura ?pila ?altura_posterior)
			(not (altura ?pila ?altura_pila))
			(disponible ?contenedor)
			(not (disponible ?objeto_base))
		)
  )

  (:action dejar-verde-verde
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor_grua - contenedor
			?altura_pila - altura
			?contenedor_pila - contenedor
			?altura_posterior - altura
		)
		:precondition(
			and
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor_grua ?grua)
			(ubicado-en ?contenedor_pila ?pila)
			(top ?contenedor_pila ?pila)
			(verde ?contenedor_grua)
			(verde ?contenedor_pila)
			(altura ?pila ?altura_pila)
			(next ?altura_pila ?altura_posterior)
		)
		:effect(
			and
			(libre ?grua)
			(ubicado-en ?contenedor_grua ?pila)
			(not (ubicado-en ?contenedor_grua ?grua))
			(encima ?contenedor_grua ?contenedor_pila)
			(top ?contenedor_grua ?pila)
			(not (top ?contenedor_pila ?pila))
			(altura ?pila ?altura_posterior)
			(not (altura ?pila ?altura_pila))
			(disponible ?contenedor_grua)
		)
  )

  (:action coger-cinta
	    :parameters (
	    	?cinta - cinta
	    	?muelle_origen - muelle
	    	?muelle_destino - muelle
	    	?grua - grua
	    	?contenedor - contenedor
	    )
		:precondition(
			and
			(libre ?grua)
			(ubicado-en ?grua ?muelle_destino)
			(conecta-a ?cinta ?muelle_origen ?muelle_destino)
			(ubicado-en ?contenedor ?cinta)
		)
		:effect(
			and
			(libre ?cinta)
			(ubicado-en ?contenedor ?grua)
			(not (ubicado-en ?contenedor ?cinta))
			(not (libre ?grua))
			(ubicado-en ?contenedor ?muelle_destino)
		)
  )

  (:action dejar-cinta
	    :parameters (
	    	?cinta - cinta
	    	?muelle_origen - muelle
	    	?muelle_destino - muelle
	    	?grua - grua
	    	?contenedor - contenedor
	    )
		:precondition(
			and
			(libre ?cinta)
			(conecta-a ?cinta ?muelle_origen ?muelle_destino)
			(ubicado-en ?grua ?muelle_origen)
			(ubicado-en ?contenedor ?grua)
			(ubicado-en ?contenedor ?muelle_origen)
		)
		:effect(
			and
			(libre ?grua)
			(not (ubicado-en ?contenedor ?grua))
			(ubicado-en ?contenedor ?cinta)
			(not (libre ?cinta))
			(not (ubicado-en ?contenedor ?muelle_origen))
		)
  )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; PUERTO Prob. 3 de Daniel P. y Alejandro G.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem problema_simple) 
(:domain puerto)
(:objects 
    grua1 - grua
    grua2 - grua

    pila1 - pila
    pila2 - pila
    pila3 - pila
    pila4 - pila
    pila5 - pila
    pila6 - pila
    pila7 - pila

    muelle1 - muelle
    muelle2 - muelle

    cinta1 - cinta
    cinta2 - cinta

    contenedor1 - contenedor
    contenedor2 - contenedor
    contenedor3 - contenedor
    contenedor4 - contenedor
    contenedor5 - contenedor
    contenedor6 - contenedor
    contenedor7 - contenedor
    contenedor8 - contenedor
    contenedor9 - contenedor
    contenedor10 - contenedor
    contenedor11 - contenedor
    contenedor12 - contenedor
    contenedor13 - contenedor

    altura_muelle1_0 - altura
    altura_muelle1_1 - altura
    altura_muelle1_2 - altura

    altura_muelle2_0 - altura
    altura_muelle2_1 - altura
    altura_muelle2_2 - altura
    altura_muelle2_3 - altura
)

(:init

    ; Muelle donde se encuentra cada contenedor
    (ubicado-en contenedor1 muelle1)
    (ubicado-en contenedor2 muelle1)
    (ubicado-en contenedor3 muelle1)
    (ubicado-en contenedor4 muelle1)

    (ubicado-en contenedor5 muelle2)
    (ubicado-en contenedor6 muelle2)
    (ubicado-en contenedor7 muelle2)
    (ubicado-en contenedor8 muelle2)
    (ubicado-en contenedor9 muelle2)
    (ubicado-en contenedor10 muelle2)
    (ubicado-en contenedor11 muelle2)
    (ubicado-en contenedor12 muelle2)
    (ubicado-en contenedor13 muelle2)

    ; Contenedores en sus pilas
    (ubicado-en contenedor1 pila1)
    (ubicado-en contenedor2 pila1)
    (ubicado-en contenedor4 pila2)
    (ubicado-en contenedor3 pila3)

    (ubicado-en contenedor5 pila4)
    (ubicado-en contenedor6 pila5)
    (ubicado-en contenedor7 pila5)

    (ubicado-en contenedor8 pila6)
    (ubicado-en contenedor9 pila6)
    (ubicado-en contenedor10 pila6)

    (ubicado-en contenedor11 pila7)
    (ubicado-en contenedor12 pila7)
    (ubicado-en contenedor13 pila7)

    ; Pilas en sus muelles
    (ubicado-en pila1 muelle1)
    (ubicado-en pila2 muelle1)
    (ubicado-en pila3 muelle1)

    (ubicado-en pila4 muelle2)
    (ubicado-en pila5 muelle2)
    (ubicado-en pila6 muelle2)
    (ubicado-en pila7 muelle2)

    ; Orden de los contenedores en cada pila
    (encima contenedor2 contenedor1)
    (encima contenedor1 pila1)

    (encima contenedor4 pila2)

    (encima contenedor3 pila3)

    (encima contenedor5 pila4)

    (encima contenedor7 contenedor6)
    (encima contenedor6 pila5)

    (encima contenedor10 contenedor9)
    (encima contenedor9 contenedor8)
    (encima contenedor8 pila6)

    (encima contenedor13 contenedor12)
    (encima contenedor12 contenedor11)
    (encima contenedor11 pila7)

    ; Gruas en sus muelles
    (ubicado-en grua1 muelle1)
    (ubicado-en grua2 muelle2)

    ; Conexion carriles de cinta
    (conecta-a cinta1 muelle1 muelle2)
    (conecta-a cinta2 muelle2 muelle1)

    ; Tops de las pilas
    (top contenedor2 pila1)
    (top contenedor4 pila2)
    (top contenedor3 pila3)
    (top contenedor5 pila4)
    (top contenedor7 pila5)
    (top contenedor10 pila6)
    (top contenedor13 pila7)

    ; Control de alturas
    (next altura_muelle1_0 altura_muelle1_1)
    (next altura_muelle1_1 altura_muelle1_2)

    (next altura_muelle2_0 altura_muelle2_1)
    (next altura_muelle2_1 altura_muelle2_2)
    (next altura_muelle2_2 altura_muelle2_3)

    ; Gruas y carriles de cinta libres
    (libre grua1)
    (libre grua2)
    (libre cinta1)
    (libre cinta2)

    ; Altura actual de cada pila contando sus contenedores
    (altura pila1 altura_muelle1_2)
    (altura pila2 altura_muelle1_1)
    (altura pila3 altura_muelle1_1)
    (altura pila4 altura_muelle2_1)
    (altura pila5 altura_muelle2_2)
    (altura pila6 altura_muelle2_3)
    (altura pila7 altura_muelle2_3)

    ; Contendores disponibles
    (disponible contenedor2)
    (disponible contenedor4)
    (disponible contenedor3)
    (disponible contenedor5)
    (disponible contenedor7)
    (disponible contenedor10)
    (disponible contenedor13)

    ; Contenedores verdes
    (verde contenedor1)
    (verde contenedor6)
    (verde contenedor11)
    (verde contenedor9)

    ; Contenedores no verdes
    (no-verde contenedor2)
    (no-verde contenedor3)
    (no-verde contenedor4)
    (no-verde contenedor5)
    (no-verde contenedor7)
    (no-verde contenedor10)
    (no-verde contenedor8)
    (no-verde contenedor12)
    (verde contenedor13)

    ; Hay que marcar que las pilas son no verdes
    (no-verde pila1)
    (no-verde pila2)
    (no-verde pila3)
    (no-verde pila4)
    (no-verde pila5)
    (no-verde pila6)
    (no-verde pila7)

    ; Hay que ubicar una pila en si misma para poder dejar contenedores en pilas vacias
    (ubicado-en pila1 pila1)
    (ubicado-en pila2 pila2)
    (ubicado-en pila3 pila3)
    (ubicado-en pila4 pila4)
    (ubicado-en pila5 pila5)
    (ubicado-en pila6 pila6)
    (ubicado-en pila7 pila7)
)

(:goal (and

    (ubicado-en contenedor1 muelle1)
    (disponible contenedor1)

    (ubicado-en contenedor6 muelle1)
    (disponible contenedor6)

    (ubicado-en contenedor11 muelle1)
    (disponible contenedor11)

    (ubicado-en contenedor9 muelle1)
    (disponible contenedor9)

))

)

; plan
1. (coger-pila muelle2 grua2 pila7 contenedor13 altura_muelle2_3 contenedor12 altura_muelle2_2)
   deleted: (libre grua2) (ubicado-en contenedor13 pila7) (top contenedor13 pila7) (encima contenedor13 contenedor12) (disponible contenedor13) (altura pila7 altura_muelle2_3)
   added: (ubicado-en contenedor13 grua2) (disponible contenedor12) (top contenedor12 pila7) (altura pila7 altura_muelle2_2)
   goals met: 1 of 8
2. (coger-pila muelle1 grua1 pila1 contenedor2 altura_muelle1_2 contenedor1 altura_muelle1_1)
   deleted: (libre grua1) (ubicado-en contenedor2 pila1) (top contenedor2 pila1) (encima contenedor2 contenedor1) (disponible contenedor2) (altura pila1 altura_muelle1_2)
   added: (ubicado-en contenedor2 grua1) (disponible contenedor1) (top contenedor1 pila1) (altura pila1 altura_muelle1_1)
   goals met: 2 of 8
3. (dejar-blanco-pila muelle2 grua2 pila4 contenedor13 altura_muelle2_1 contenedor5 altura_muelle2_2)
   deleted: (ubicado-en contenedor13 grua2) (top contenedor5 pila4) (altura pila4 altura_muelle2_1) (disponible contenedor5)
   added: (libre grua2) (ubicado-en contenedor13 pila4) (encima contenedor13 contenedor5) (top contenedor13 pila4) (altura pila4 altura_muelle2_2) (disponible contenedor13)
   goals met: 2 of 8
4. (dejar-cinta cinta1 muelle1 muelle2 grua1 contenedor2)
   deleted: (ubicado-en contenedor2 grua1) (libre cinta1) (ubicado-en contenedor2 muelle1)
   added: (libre grua1) (ubicado-en contenedor2 cinta1)
   goals met: 2 of 8
5. (coger-pila muelle2 grua2 pila7 contenedor12 altura_muelle2_2 contenedor11 altura_muelle2_1)
   deleted: (libre grua2) (ubicado-en contenedor12 pila7) (top contenedor12 pila7) (encima contenedor12 contenedor11) (disponible contenedor12) (altura pila7 altura_muelle2_2)
   added: (ubicado-en contenedor12 grua2) (disponible contenedor11) (top contenedor11 pila7) (altura pila7 altura_muelle2_1)
   goals met: 3 of 8
6. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor12)
   deleted: (ubicado-en contenedor12 grua2) (libre cinta2) (ubicado-en contenedor12 muelle2)
   added: (libre grua2) (ubicado-en contenedor12 cinta2)
   goals met: 3 of 8
7. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor12)
   deleted: (ubicado-en contenedor12 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor12 grua1) (ubicado-en contenedor12 muelle1)
   goals met: 3 of 8
8. (coger-pila muelle2 grua2 pila7 contenedor11 altura_muelle2_1 pila7 altura_muelle2_0)
   deleted: (libre grua2) (ubicado-en contenedor11 pila7) (top contenedor11 pila7) (encima contenedor11 pila7) (disponible contenedor11) (altura pila7 altura_muelle2_1)
   added: (ubicado-en contenedor11 grua2) (disponible pila7) (top pila7 pila7) (altura pila7 altura_muelle2_0)
   goals met: 2 of 8
9. (dejar-blanco-pila muelle1 grua1 pila3 contenedor12 altura_muelle1_1 contenedor3 altura_muelle1_2)
   deleted: (ubicado-en contenedor12 grua1) (top contenedor3 pila3) (altura pila3 altura_muelle1_1) (disponible contenedor3)
   added: (libre grua1) (ubicado-en contenedor12 pila3) (encima contenedor12 contenedor3) (top contenedor12 pila3) (altura pila3 altura_muelle1_2) (disponible contenedor12)
   goals met: 2 of 8
10. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor11)
   deleted: (ubicado-en contenedor11 grua2) (libre cinta2) (ubicado-en contenedor11 muelle2)
   added: (libre grua2) (ubicado-en contenedor11 cinta2)
   goals met: 2 of 8
11. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor11)
   deleted: (ubicado-en contenedor11 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor11 grua1) (ubicado-en contenedor11 muelle1)
   goals met: 3 of 8
12. (coger-pila muelle2 grua2 pila5 contenedor7 altura_muelle2_2 contenedor6 altura_muelle2_1)
   deleted: (libre grua2) (ubicado-en contenedor7 pila5) (top contenedor7 pila5) (encima contenedor7 contenedor6) (disponible contenedor7) (altura pila5 altura_muelle2_2)
   added: (ubicado-en contenedor7 grua2) (disponible contenedor6) (top contenedor6 pila5) (altura pila5 altura_muelle2_1)
   goals met: 4 of 8
13. (dejar-verde-verde muelle1 grua1 pila1 contenedor11 altura_muelle1_1 contenedor1 altura_muelle1_2)
   deleted: (ubicado-en contenedor11 grua1) (top contenedor1 pila1) (altura pila1 altura_muelle1_1)
   added: (libre grua1) (ubicado-en contenedor11 pila1) (encima contenedor11 contenedor1) (top contenedor11 pila1) (altura pila1 altura_muelle1_2) (disponible contenedor11)
   goals met: 5 of 8
14. (dejar-blanco-pila muelle2 grua2 pila7 contenedor7 altura_muelle2_0 pila7 altura_muelle2_1)
   deleted: (ubicado-en contenedor7 grua2) (top pila7 pila7) (altura pila7 altura_muelle2_0) (disponible pila7)
   added: (libre grua2) (ubicado-en contenedor7 pila7) (encima contenedor7 pila7) (top contenedor7 pila7) (altura pila7 altura_muelle2_1) (disponible contenedor7)
   goals met: 5 of 8
15. (coger-pila muelle2 grua2 pila5 contenedor6 altura_muelle2_1 pila5 altura_muelle2_0)
   deleted: (libre grua2) (ubicado-en contenedor6 pila5) (top contenedor6 pila5) (encima contenedor6 pila5) (disponible contenedor6) (altura pila5 altura_muelle2_1)
   added: (ubicado-en contenedor6 grua2) (disponible pila5) (top pila5 pila5) (altura pila5 altura_muelle2_0)
   goals met: 4 of 8
16. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor6)
   deleted: (ubicado-en contenedor6 grua2) (libre cinta2) (ubicado-en contenedor6 muelle2)
   added: (libre grua2) (ubicado-en contenedor6 cinta2)
   goals met: 4 of 8
17. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor6)
   deleted: (ubicado-en contenedor6 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor6 grua1) (ubicado-en contenedor6 muelle1)
   goals met: 5 of 8
18. (coger-pila muelle2 grua2 pila6 contenedor10 altura_muelle2_3 contenedor9 altura_muelle2_2)
   deleted: (libre grua2) (ubicado-en contenedor10 pila6) (top contenedor10 pila6) (encima contenedor10 contenedor9) (disponible contenedor10) (altura pila6 altura_muelle2_3)
   added: (ubicado-en contenedor10 grua2) (disponible contenedor9) (top contenedor9 pila6) (altura pila6 altura_muelle2_2)
   goals met: 6 of 8
19. (dejar-blanco-pila muelle1 grua1 pila2 contenedor6 altura_muelle1_1 contenedor4 altura_muelle1_2)
   deleted: (ubicado-en contenedor6 grua1) (top contenedor4 pila2) (altura pila2 altura_muelle1_1) (disponible contenedor4)
   added: (libre grua1) (ubicado-en contenedor6 pila2) (encima contenedor6 contenedor4) (top contenedor6 pila2) (altura pila2 altura_muelle1_2) (disponible contenedor6)
   goals met: 7 of 8
20. (dejar-blanco-pila muelle2 grua2 pila5 contenedor10 altura_muelle2_0 pila5 altura_muelle2_1)
   deleted: (ubicado-en contenedor10 grua2) (top pila5 pila5) (altura pila5 altura_muelle2_0) (disponible pila5)
   added: (libre grua2) (ubicado-en contenedor10 pila5) (encima contenedor10 pila5) (top contenedor10 pila5) (altura pila5 altura_muelle2_1) (disponible contenedor10)
   goals met: 7 of 8
21. (coger-pila muelle2 grua2 pila6 contenedor9 altura_muelle2_2 contenedor8 altura_muelle2_1)
   deleted: (libre grua2) (ubicado-en contenedor9 pila6) (top contenedor9 pila6) (encima contenedor9 contenedor8) (disponible contenedor9) (altura pila6 altura_muelle2_2)
   added: (ubicado-en contenedor9 grua2) (disponible contenedor8) (top contenedor8 pila6) (altura pila6 altura_muelle2_1)
   goals met: 6 of 8
22. (coger-pila muelle1 grua1 pila3 contenedor12 altura_muelle1_2 contenedor3 altura_muelle1_1)
   deleted: (libre grua1) (ubicado-en contenedor12 pila3) (top contenedor12 pila3) (encima contenedor12 contenedor3) (disponible contenedor12) (altura pila3 altura_muelle1_2)
   added: (ubicado-en contenedor12 grua1) (disponible contenedor3) (top contenedor3 pila3) (altura pila3 altura_muelle1_1)
   goals met: 6 of 8
23. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor9)
   deleted: (ubicado-en contenedor9 grua2) (libre cinta2) (ubicado-en contenedor9 muelle2)
   added: (libre grua2) (ubicado-en contenedor9 cinta2)
   goals met: 6 of 8
24. (coger-cinta cinta1 muelle1 muelle2 grua2 contenedor2)
   deleted: (ubicado-en contenedor2 cinta1) (libre grua2)
   added: (libre cinta1) (ubicado-en contenedor2 grua2) (ubicado-en contenedor2 muelle2)
   goals met: 6 of 8
25. (dejar-cinta cinta1 muelle1 muelle2 grua1 contenedor12)
   deleted: (ubicado-en contenedor12 grua1) (libre cinta1) (ubicado-en contenedor12 muelle1)
   added: (libre grua1) (ubicado-en contenedor12 cinta1)
   goals met: 6 of 8
26. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor9)
   deleted: (ubicado-en contenedor9 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor9 grua1) (ubicado-en contenedor9 muelle1)
   goals met: 7 of 8
27. (dejar-blanco-pila muelle1 grua1 pila3 contenedor9 altura_muelle1_1 contenedor3 altura_muelle1_2)
   deleted: (ubicado-en contenedor9 grua1) (top contenedor3 pila3) (altura pila3 altura_muelle1_1) (disponible contenedor3)
   added: (libre grua1) (ubicado-en contenedor9 pila3) (encima contenedor9 contenedor3) (top contenedor9 pila3) (altura pila3 altura_muelle1_2) (disponible contenedor9)
   goals met: 8 of 8
